Revit 2024 API
Subelement.GetReference Method
 Obtains the reference to this subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public Reference GetReference()
Visual Basic
Public Function GetReference As Reference
Visual C++
public:
Reference^ GetReference()
Return Value
 The reference to this subelement.
See Also
Subelement Class
Autodesk.Revit.DB Namespace